results/results_c5_large/results_c5_large_run2/oltp_read_write_t16/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 85.99 qps: 1734.82 (r/w/o: 1217.00/103.08/414.73) lat (ms,95%): 325.98 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 88.20 qps: 1767.14 (r/w/o: 1237.73/104.20/425.21) lat (ms,95%): 331.91 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 86.40 qps: 1733.20 (r/w/o: 1213.00/102.10/418.10) lat (ms,95%): 344.08 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 87.00 qps: 1737.70 (r/w/o: 1216.90/102.20/418.60) lat (ms,95%): 320.17 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 83.70 qps: 1670.80 (r/w/o: 1168.70/98.70/403.40) lat (ms,95%): 344.08 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 87.10 qps: 1741.29 (r/w/o: 1218.50/103.90/418.90) lat (ms,95%): 337.94 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 87.90 qps: 1752.91 (r/w/o: 1226.30/104.70/421.90) lat (ms,95%): 314.45 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 86.90 qps: 1741.90 (r/w/o: 1219.90/104.20/417.80) lat (ms,95%): 325.98 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 71.40 qps: 1431.50 (r/w/o: 1002.60/85.30/343.60) lat (ms,95%): 376.49 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 70.10 qps: 1403.40 (r/w/o: 982.30/84.80/336.30) lat (ms,95%): 411.96 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 67.00 qps: 1338.70 (r/w/o: 936.90/80.50/321.30) lat (ms,95%): 411.96 err/s: 0.10 reconn/s: 0.00
[ 120s ] thds: 16 tps: 71.60 qps: 1427.10 (r/w/o: 998.50/86.20/342.40) lat (ms,95%): 397.39 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            136497
        write:                           11614
        other:                           46881
        total:                           194992
    transactions:                        9749   (81.05 per sec.)
    queries:                             194992 (1621.07 per sec.)
    ignored errors:                      1      (0.01 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      81.0486
    time elapsed:                        120.2858s
    total number of events:              9749

Latency (ms):
         min:                                   67.34
         avg:                                  197.25
         max:                                  647.81
         95th percentile:                      356.70
         sum:                              1922987.01

Threads fairness:
    events (avg/stddev):           609.3125/7.35
    execution time (avg/stddev):   120.1867/0.07